app/controllers/donors_controller.rb

SELECT "donors".* FROM "donors"
SELECT  "donors".* FROM "donors"  WHERE "donors"."blood_type" = 'All' AND "donors"."location" = 'singa' LIMIT 50
SELECT  "donors".* FROM "donors"  WHERE "donors"."location" = 'Singapore' LIMIT 50
SELECT  "donors".* FROM "donors"  WHERE "donors"."blood_type" = 'O-' LIMIT 1
---
	def index
		search = params[:search]
		@blood_types = ['All', 'O+', 'O-', 'A+', 'A-', 'B+', 'B-', 'AB+', 'AB-'];

		if search
			@blood_type = search[:blood_type]
			@location = search[:location]

			if search[:blood_type] == 'All' && search[:location].blank?

				@donors = Donor.all
			else
				if search[:blood_type] != 'All'
					if search[:location].blank?
						@donors = Donor.where(blood_type: search[:blood_type]).take(50)
					else
						@donors = Donor.where(blood_type: search[:blood_type], location: search[:location]).take(50)
					end
				else
					@donors = Donor.where(location: search[:location]).take(50)
				end
			end
		else
			@donors = Donor.all

INSERT INTO "users" ("created_at", "password", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-09 11:34:39.518802"], ["password", "test"], ["updated_at", "2014-09-09 11:34:39.518802"], ["username", "test"]]
SELECT  "fb_users".* FROM "fb_users"  WHERE "fb_users"."fb_id" = '10152744743826941' LIMIT 1
INSERT INTO "donors" ("created_at", "name", "notes", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-09 06:48:19.284149"], ["name", "test"], ["notes", "adsfa"], ["updated_at", "2014-09-09 06:48:19.284149"]]
UPDATE "fb_users" SET "updated_at" = ?, "user_id" = ? WHERE "fb_users"."id" = 1  [["updated_at", "2014-10-02 11:48:33.313408"], ["user_id", 6]]
---
	def create
		user = User.new(user_params)
		user.save

		donor = donor_params.clone
		donor[:user_id] = user.id

		@donor = Donor.new(donor)

		if params[:donor][:fb_id]
			fb_user =  FbUser.find_by fb_id: params[:donor][:fb_id]
			fb_user.user_id = user.id
			fb_user.save

SELECT  "donors".* FROM "donors"  WHERE "donors"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@donor = Donor.find(params[:id])

SELECT  "donors".* FROM "donors"  WHERE "donors"."id" = ? LIMIT 1  [["id", 2]]
---
	def edit
		@donor = Donor.find(params[:id])

SELECT  "donors".* FROM "donors"  WHERE "donors"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "donors" SET "contact_info" = ?, "location" = ?, "name" = ?, "occupation" = ?, "updated_at" = ? WHERE "donors"."id" = 1  [["contact_info", "nothing here"], ["location", "somewhere"], ["name", "Administrator"], ["occupation", "administrator"], ["updated_at", "2014-09-10 06:40:43.950601"]]
---
	def update
		@donor = Donor.find(params[:id])

		if @donor.user_id == session[:user_id]
			if @donor.update(donor_params)

SELECT  "donors".* FROM "donors"  WHERE "donors"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "donors" WHERE "donors"."id" = ?  [["id", 2]]
---
	def destroy
		if session[:user_id] == 1
			@donor = Donor.find(params[:id])
			@donor.destroy