app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'test' AND "users"."password" = 'test' LIMIT 1
SELECT  "donors".* FROM "donors"  WHERE "donors"."user_id" = 1 LIMIT 1
---
  def authenticate
		p = params[:user]
		user = User.find_by username: p[:username], password: p[:password]

		if user
			donor = Donor.find_by user_id: user.id

SELECT  "fb_users".* FROM "fb_users"  WHERE "fb_users"."fb_id" = '10152744743826941' LIMIT 1
SELECT  "donors".* FROM "donors"  WHERE "donors"."user_id" = 6 LIMIT 1
---
  def fblogin
  	fb_user = FbUser.find_by fb_id: params[:fb_id]

  	if fb_user
  		if fb_user.user_id
  			donor = Donor.find_by user_id: fb_user.user_id